// Domashka4.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;

int main()
{
    int a;
    int b;
    int c;
    int x;
    cin >> a;
    cin >> b;
    cin >> c;
    int D = b * b - 4 * a * c;
    if (D > 0) {
        cout << (-b + sqrt(D)) / (2*a) << endl;
        cout << (-b - sqrt(D)) / (2 * a);
    }
    if (D == 0) {
        cout << (-b + sqrt(D)) / (2 * a);
    }
    if (D < 0) {
        cout << "unappropriate input";
    }

}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
